app/controllers/stage_controller.rb

SELECT data FROM "stage_ones" WHERE "stage_ones"."processed" = 'f' LIMIT 100
---
  def one_data
    data = StageOne.find_all_by_processed(false, :limit => 100, :select => "data, id")